[{"id":"1","evenname":"Idea Presentation","date":"2019-01-18","duration":"1 hours","team":"3 members","rules":"Rules UG:\n\nIdea Presentation is an event in which participants will represent their innovative ideas that can represent Robotic Process Automation. Their ideas will be an amalgam of their thoughts, creativity, imagination power, coding, implementation and presentation. Further more it will be an attempt to provide a solution to a real life problem. \nRules of the event:\n\nParticipants can make a working model of their innovative ideas.\nIn case the particpants use any hardware\/software then they must bring it along with a laptop.\nParticipants have to present their innovative ideas through a poster and a model.\nPoster should be of A2 Size.\nPoster must contain idea definition, details of idea (in image form if possible), details of hardware\/software components (if used), application area of their idea.\nTeam size: 3 participants.\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\nFor further information about UG - Idea Presentation contact:\nProf. Jyoti Dubey\t09898537644\nProf. Monika Gupta\t09408323079\nProf. Riddhi Kundal\t07228849191\n\nRules PG:\n\nIdea Presentation is an event in which participants will represent their innovative ideas through Chatbots. Their ideas will be an amalgam of their thoughts, creativity, imagination power, coding, implementation and presentation. Further more it will be an attempt to provide a solution to a real life problem. \nRules of the event:\n\nThe participants are supposed to bring fully developed Chatbot using any technology of their choice.\nThe chatbot should clearly reflect the solution to the stated problem as defined by the participants.\nParticpants can choose any domain areas like finance, education, healthcare, management etc for implementing chatbots.\nThe Chatbot can be built using any language\/technology.\nParticpants have to bring working Chatbot along with the source code in their laptop.\nThe participants will be given space to exhibit the working model during the event.\nThe judges may ask for runtime changes in the source code of the Chatbot.\nTeam size: Max 3 participants.\nThe duration of the event will be of 2 hrs .\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\nFor further information about UG - Idea Presentation contact:\nProf. Pooja Ajwani\t09558670306\nDr. Zakiya Malek\t09427333141","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/ideapresentation.jpg","btns":"0","ug":"https:\/\/goo.gl\/forms\/GntW08CwRc1ZfEaO2","pg":"https:\/\/goo.gl\/forms\/Fs3VKOJQVwMybnTr1"},{"id":"2","evenname":"Java Marathon","date":"2019-01-18","duration":"1 hours","team":"3 members","rules":"Rules PG:\n\nFun filled brain exercise where-in focusing on the fundamentals, programmers can publicly showcase and enhance their technical skill. The marathon is targeted to improve the programming and competitive programming skills of the students. Contestants would be given a clearly defined programming puzzle, the solution of which should be offered by the contestants using the core concepts of Java like object orientation and GUI in a given time frame. \nRules of the event:\n\n1. The participants are supposed to develop a code for the problem that will be given to them.\n2. The problem definition will be given on the spot.\n3. Coding has to be done in Core Java.\n4. The participants are supposed to work on Ubuntu\/Mac machines as provided by institution.\n5. The participants can use any one editor from Scite\/ Sublime\/ gedit\/ Eclipse.\n6. Team size: 2 participants.\n7. The duration of the event will be of 4 hrs .\n8. Each member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\n\nProf. Rupal Shah\t09825898398\nProf. Snehal Shukla\t09429575889","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/javamarathon.jpg","btns":"0","ug":"","pg":"https:\/\/goo.gl\/forms\/UllrQSpMNeryQK042"},{"id":"3","evenname":"Relay Programming","date":"2019-01-18","duration":"1 hours","team":"3 members","rules":"Rules UG:\n\nRelay Programming is a team event wherein the team coordination and individuals programming skills will be tested. Only one member will be allowed to code or conceptualize at a given moment of time. \nRules of the event:\n\nThe participants are supposed to develop a code for the problem that will be given to them.\nCoding has to be done in C++ on Ubuntu\/Mac machines as provided by institution.\nThe participants can use any one editor from Scite\/ Sublime\/ gedit. The compiler provided will be G++.\nThe problem definition will be given on the spot, visible to only first member of the team.\nAfter 40 minutes a buzzer will be blown and the 1st member of the team has to stop coding. The 2nd member of the team will have to start coding.\nAfter 20 minutes a buzzer will be blown again and the 2nd member of the team has to stop coding. The 3rd member of the team will have to start coding. He\/She will get only 15 minutes to complete the remaining task.\nThe team with the best time management and most accurate output will win.\nTeam size: 3 members.\nThe duration of the event will be of 1.15 hrs .\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\nFor further information about UG - Relay Programming contact:\nProf. Disha Shah\t09979880007\nProf. Nirav Suthar\t09723599635\nDr. Purna Tanna\t08401866040","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/relayprogramming.jpg","btns":"0","ug":"https:\/\/goo.gl\/forms\/mzIAmQxF3xOqH6mg2","pg":""},{"id":"4","evenname":"Robo Race","date":"2019-01-18","duration":"2 hours","team":"2 members","rules":"Rules UG:\n\nThe primary challenge for this competition is to run a Lego robot that can find its way through an arena that through a maze and arrive at the destination in the shortest time. The goal of the competition is to make a robot that can operate successfully in the real world, not just in the laboratory. Such a robot must be able to operate successfully where there are uncertainty and imprecision. \nRules of the event:\n\nThis event is common for both PG and UG students, there are no seperate tracks.\nThe participants are supposed to assemble a robot and write code for racing the robot.\nThe participants will be provided with a LEGO kit for the Robo Race.\nThe participants will have to take utmost care of the LEGO kit.\nOnce turned on, the robot must be autonomous without any human intervention. That is, they are not to be manually controlled using any devices.\nParticipants are not allowed to interfere or assist the robot while it is running (performing the activity).\nTeam size: 3 members.\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\nThe participant will have to attend a free 1 day workshop on Robotics before the event, in which they will learn the basics of robotics and electronics.\n\nFor further information about UG - Robo Race contact:\nDr. Ankit Bhavsar\t09825009481\nProf. Baharat Kataria\t09727562616\n\n\nRules PG:\n\nThe primary challenge for this competition is to run a Lego robot that can find its way through an arena that through a maze and arrive at the destination in the shortest time. The goal of the competition is to make a robot that can operate successfully in the real world, not just in the laboratory. Such a robot must be able to operate successfully where there are uncertainty and imprecision. \nRules of the event:\nThis event is common for both PG and UG students, there are no seperate tracks.\nThe participants are supposed to assemble a robot and write code for racing the robot.\nThe participants will be provided with a LEGO kit for the Robo Race.\nThe participants will have to take utmost care of the LEGO kit.\nOnce turned on, the robot must be autonomous without any human intervention. That is, they are not to be manually controlled using any devices.\nParticipants are not allowed to interfere or assist the robot while it is running (performing the activity).\nTeam size: 3 members.\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\nThe participant will have to attend a free 1 day workshop on Robotics before the event, in which they will learn the basics of robotics and electronics.\n\nFor further information about PG - Robo Race contact:\nProf. Vishal Narvani\t09998340021\nProf. Dinesh Kalal\t09636484074","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/robo.jpg","btns":"0","ug":"https:\/\/goo.gl\/forms\/2ZJ823WQRGpDp1St1","pg":"https:\/\/goo.gl\/forms\/0VPtJiaUL3MczEMk2"},{"id":"5","evenname":"Database Treasurehunt","date":"2019-01-18","duration":"1 hours","team":"3 members","rules":"Rules UG:\n\nA fun filled technical team event that will test logical acumen, coordination, speed to find the treasures hidden across the campus.\nRules of the event:\n\nThe event will be conducted in 2 rounds.\nFirst round will be Puzzle Round (Elinimation Round).\nIn Final round, Team has to find Hidden Treasure.\nTeams who qualify for the final round, should follow the rules declared at the time of event to find the hidden treasure.\nTeam size: 2 members.\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\nFor further information about UG - Database Treasure Hunt contact:\nProf. Shaily Thaker\t09427060118\nProf. Prof. Bharti Shah\t09662023074\nProf. Chitresha Jain\t09530081471\n\nRules PG:\n\nA fun filled technical team event that will test logical acumen, coordination, speed to find the treasures hidden across the campus.\nRules of the event:\nThe participants will be given a predefined MySQL database to run queries.\nCommand Line Terminal will be provided to the participants on Ubuntu\/Mac machines.\nThe Format of the game will be disclosed on the spot based on which the hidden treasures are to be found.\nThe duration of the event will be of 1 hour.\nTeam size: 5 members.\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\nFor further information about PG - Database Treasure Hunt contact:\nProf. Rachana Chaudhari\t07698341627\nProf. Prerna Agarwal\t09979149112\nProf. Darshita Kalyani\t09427430660","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/dbtreasurehunt.jpg","btns":"0","ug":"https:\/\/goo.gl\/forms\/n4jlN4keq4mB9Ohr1","pg":"https:\/\/goo.gl\/forms\/PFJou5WPf4jzmdqj2"},{"id":"6","evenname":"RPA Project","date":"2019-01-18","duration":"1 hours","team":"3 members","rules":"Rules PG:\n\nThe goal of Robotics Process Automation (RPA) projects is to provide a unique opportunity to introduce robotics to solve a variety of science, technology, engineering and math (STEM) problems. \nRules of the event:\n\nEach team needs to construct a unique solution, which demonstrates the usage of Robotics process automation.\nThe participants can use arduino\/raspberry pi or any other similar circuit board to design a working model.\nEach team is supposed to submit their idea presentation on or before 4rth February-2019.\nThe participants will be given space to exhibit the working model during the event.\nTeam size: 3 participants.\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\nFor further information about RPA projects contact:\nProf. Vishal Narvani\t09998340021\nProf. Dinesh Kalal\t09636484074","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/RPA.jpg","btns":"0","ug":"","pg":"https:\/\/goo.gl\/forms\/9jS0EueeeYKEERJi1"},{"id":"7","evenname":"IT Quiz","date":"2019-01-18","duration":"1 hours","team":"3 members","rules":"Rules UG:\n\nIT quiz is a mind sport team event where the individual as well as team will be tested for their knowledge in the area of IT.\nRules of the event:\nThe IT Quiz will be conducted in two Phases: Elimination and Final.\nIn elimination phase, the questions will be in the form of multiple choice, True \/ False statement.\nThe duration of Elimination Phase will be 30 minutes.\nParticipants clearing Elimination Phase will be permitted in Final Phase.\nThree teams will be considered for Final Phase.\nBoth the quizzes will be based on technical questions related to computer science \/ new technology.\nThe participants will not be allowed to use mobile or other electronic instruments.\nTeam size: 3 members.\nEach member of the team need to be register for participating.\nThe decision of the Quiz Master will be considered as final.\n\nFor further information about UG - IT QUIZ contact:\nProf. Hemali Moradiya\t09904086377\nProf. Vidhi Thakkar\t09925535511\nProf. Anjali Bobra\t08000251860\nProf. Jainin Vakil\t09408644540\n\nRules PG:\n\nT quiz is a mind sport team event where the individual as well as team will be tested for their knowledge in the area of IT.\nRules of the event:\nThe IT Quiz will be conducted in two Phases: Elimination and Final.\nIn elimination phase, the questions will be in the form of multiple choice, True \/ False statement.\nThe duration of Elimination Phase will be 30 minutes.\nFour teams clearing Elimination Phase will be permitted in Final Phase.\nThe duration of Final Phase will be 60 minutes.\nBoth the quizzes will be based on technical questions related to computer science \/ new technology.\nThe participants will not be allowed to use mobile or other electronic instruments.\nThe details of the final round will be given during the time of quiz itself.\nTeam size: 2 members.\nEach member of the team need to be register for participating.\nThe decision of the Quiz Master will be considered as final.\n\nFor further information about PG - IT QUIZ contact:\nDr. Devarshi Mehta\t09427318966\nProf. Krupa Mehta\t09427754148\nProf. Jyotika Yadav\t09924405931\n","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/itquiz.jpg","btns":"0","ug":"https:\/\/goo.gl\/forms\/AoDm4uM6RYSDvBuE2","pg":"https:\/\/goo.gl\/forms\/XSVW5sidPuQFmLdF3"},{"id":"8","evenname":"Logo Designing","date":"2019-01-01","duration":"check","team":"5","rules":"Rules UG:\n\nLogo Design is an event where the participants artistic and creative mind will be tested. It will also test how they can use tools to convert the thought into a design. The participants will have to design a logo on the theme given to them.\nRules of the event:\nThe participants can design the logo using Scribus\/Pinta\nThe participants will be provided Ubuntu machines to work.\nThe logo should depict the theme defined properly.\nThe Theme of the logo design will be given on the spot.\nThe duration of the event will be of 2 hour.\nTeam size: 2 members.\nEach member of the team need to be register for participating.\nThe Judges decision would be considered as final.\n\nFor further information about UG - Logo Design contact:\nProf. Rinkal Shah\t09173073936\nProf. Garima Mishra\t08758865557","image":"https:\/\/github.com\/rv98\/cybershadz\/raw\/master\/flex.jpg","btns":"0","ug":"https:\/\/goo.gl\/forms\/Cbly6rzTHAG0FEcf2","pg":""}]
